Core/src/InformationRegisters/НастройкиКассыШтрихМ/НастройкиКассыШтрихМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиКассыШтрихМ</name>
  <resources>
    <name>ДатаНачалаЗапросаЧеков</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияЗапросаЧеков</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗапроситьЧекиНаСервереШтрихМ</name>
    <comment>(служебный) для обмена кассовыми чеками</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗарегистрированНаСервереШтрихМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗарегистрироватьТоварыНаСервереШтрихМ</name>
    <comment>(служебный) для обмена товарами</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторОбластиНаСервереШтрихМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОчиститьТоварыНаСервереШтрихМ</name>
    <comment>(служебный) для обмена товарами</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроверитьРегистрациюТоваровНаСервереШтрихМ</name>
    <comment>(служебный) для обмена товарами</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Токен</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторТарификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрайсЛист</name>
    <type>
      <types>CatalogRef.ПрайсЛисты</types>
    </type>
  </resources>
  <resources>
    <name>СообщениеПриРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДСВключатьВСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭквайринговыйТерминал</name>
    <type>
      <types>CatalogRef.ЭквайринговыеТерминалы</types>
    </type>
  </resources>
  <resources>
    <name>ВидСкидкиНаценки</name>
    <type>
      <types>CatalogRef.ВидыСкидокНаценок</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ОтключенаЛицензия</name>
    <comment>Отключен на сервере тарификации</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/СостоянияРегистрацииКассовогоАппарата/СостоянияРегистрацииКассовогоАппарата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияРегистрацииКассовогоАппарата</name>
  <enumValues>
    <name>НеПодключен</name>
  </enumValues>
  <enumValues>
    <name>Подключен</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПодключение</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПереподключение</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетОтключение</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/ПрайсЛисты/ПрайсЛисты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрайсЛисты</name>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантыСортировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьДатуФормирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьКонтактнуюИнформацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНоменклатуруБезЦен</name>
    <comment>Выводить номенклатуру даже в том случае, если нет установленных цен.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасчетаКурсаВалюты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИерархияСодержимого</name>
    <type>
      <types>EnumRef.ИерархияПрайсЛистов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменятьРазмерПропорционально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаВысота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаШирина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКолонок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеЦеныПредставлением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтмечатьНовинки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЦен</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьПрайсЛиста</name>
    <type>
      <types>EnumRef.ВариантыПечатиПрайсЛиста</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоложениеТекстаОтносительноМеткиНовинка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОстатков</name>
    <comment>1 - числом, 2 - ассоциативное представление</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовоеПредставлениеОстатковДостаточно</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовоеПредставлениеОстатковМало</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовоеПредставлениеОстатковМного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьПоНаличию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредставлениеНоменклатуры</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитНоменклатуры</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрРасшифровки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СлужебныйУправлениеВидимостью</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЦен</name>
    <attributes>
      <name>ВидЦен</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КатегорииНоменклатуры</name>
    <attributes>
      <name>КатегорияНоменклатуры</name>
      <type>
        <types>CatalogRef.КатегорииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦеновыеГруппы</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/InformationRegisters/НастройкиКассыШтрихМ/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользуютсяХарактеристики = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	
	Элементы.ПротоколОбмена.Видимость = ИнтеграцияОбменШтрихМКлиентСервер.РежимОтладкиОбменаШтрихМ();
	
	Если НЕ Параметры.Свойство("Отбор") ИЛИ НЕ Параметры.Отбор.Свойство("КассаККМ") ИЛИ
		(Параметры.Отбор.Свойство("КассаККМ") И НЕ ЗначениеЗаполнено(Параметры.Отбор.КассаККМ)) Тогда
		
		Элементы.ГруппаДанных.Видимость = Ложь;
		Элементы.ГруппаНетДанных.Видимость = Истина;
		
	Иначе
		Элементы.ГруппаДанных.Видимость = Истина;
		Элементы.ГруппаНетДанных.Видимость = Ложь;
		Запись.КассаККМ = Параметры.Отбор.КассаККМ;
		
		ПриЧтенииСозданииНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПриЧтенииСозданииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ПерейтиКЗаполнениюЦен(Команда)
	
	Если ИспользуютсяХарактеристики Тогда
		ОткрытьФорму("Обработка.Ценообразование.Форма.ФормаПомощника");
	Иначе
		ОткрытьФорму(
			"РегистрСведений.НастройкиКассыШтрихМ.Форма.ФормаРедактированияЦен",
			Новый Структура("ПрайсЛист", Запись.ПрайсЛист),,,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрационныйНомерПриИзменении(Элемент)
	ЗаписатьЗапись();
КонецПроцедуры

&НаКлиенте
Процедура ТокенПриИзменении(Элемент)
	ЗаписатьЗапись();
КонецПроцедуры

&НаКлиенте
Процедура ПрайсЛистПриИзменении(Элемент)
	ЗаписатьЗапись();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПрайсЛиста(Команда)
	ОткрытьФорму(
		"Обработка.ФормированиеПрайсЛистов.Форма", 
		Новый Структура("ПрайсЛист", Запись.ПрайсЛист));
КонецПроцедуры

&НаКлиенте
Процедура ПротоколОбмена(Команда)
	ОткрытьФорму("РегистрСведений.НастройкиКассыШтрихМ.Форма.ФормаПротокола",Новый Структура("Касса", Запись.КассаККМ));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Подключить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Запись.РегистрационныйНомер) Тогда
		ТекстСообщения = НСтр("ka='Введите регистрационный номер, полученный при регистрации ККМ в ФНС.';ru='Введите регистрационный номер, полученный при регистрации ККМ в ФНС.';en='Enter the registration number you received when registering in CMC FTS.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Запись.РегистрационныйНомер");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.Токен) Тогда
		ТекстСообщения = НСтр("ru='Введите пароль для подключения (token),"
"полученный на ККМ при регистрации у оператора фискальных данных (ОФД).';ka='Введите пароль для подключения (token),"
"полученный на ККМ при регистрации у оператора фискальных данных (ОФД).'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ЗаписьТокен");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.ПрайсЛист) Тогда
		ТекстСообщения = НСтр("ka='Для работы с кассой необходим прайс-лист для указания цен.';ru='Для работы с кассой необходим прайс-лист для указания цен.';en='To work with the cashier needs a price list to indicate prices.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ПрайсЛист");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОЗаписиОбъекта", ЭтотОбъект);
	
	Если Модифицированность Тогда
		ЗаголовокВопроса = Нстр("ka='Подключение кассового аппарата';ru='Подключение кассового аппарата';en='Connecting the cash register'");
		ТекстВопроса = Нстр("ka='Для подключения необходимо сохранить введенные данные. Сохранить?';ru='Для подключения необходимо сохранить введенные данные. Сохранить?';en='To connect you need to save the entered data. Save?'");
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Да, Нстр("ka='შენახვა';ru='Сохранить';en='retain'"));
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, Нстр("ka='გაუქმება';ru='Отменить';en='cancel'"));
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, СписокКнопок,, КодВозвратаДиалога.Да, ЗаголовокВопроса);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Да);
	КонецЕсли;
КонецПроцедуры

//
&НаКлиенте
Процедура ВыгрузитьТовары(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаВыгрузкаТоваров", ЭтотОбъект);
	
	ЗаголовокВопроса = Нстр("ka='Выгрузка товаров и цен для кассового аппарата';ru='Выгрузка товаров и цен для кассового аппарата';en='Unloading of goods and prices for the cash register'");
	ТекстВопроса = Нстр("ka='Все товары и цены будут выгружены в кассовый аппарат. Выгрузить?';ru='Все товары и цены будут выгружены в кассовый аппарат. Выгрузить?';en='All products and prices will be uploaded to the cash register. Unload?'");
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить(КодВозвратаДиалога.Да, Нстр("ka='გადმოტვირთვა';ru='Выгрузить';en='unload'"));
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, Нстр("ka='გაუქმება';ru='Отменить';en='cancel'"));
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, СписокКнопок,, КодВозвратаДиалога.Да, ЗаголовокВопроса);
КонецПроцедуры

//
&НаКлиенте
Процедура ОчиститьТовары(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаУдалениеТоваров", ЭтотОбъект);
	
	ЗаголовокВопроса = Нстр("ka='Удаление товаров и цен с кассового аппарата';ru='Удаление товаров и цен с кассового аппарата';en='Removal of goods and price to cash register'");
	ТекстВопроса = Нстр("ka='Вы действительно хотите удалить все товары и цены с кассового аппарата?';ru='Вы действительно хотите удалить все товары и цены с кассового аппарата?';en='Are you sure you want to remove all the products and prices to the cash register?'");
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить(КодВозвратаДиалога.Да, Нстр("ka='წაშლა';ru='Удалить';en='Delete'"));
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, Нстр("ka='გაუქმება';ru='Отменить';en='cancel'"));
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, СписокКнопок,, КодВозвратаДиалога.Да, ЗаголовокВопроса);
КонецПроцедуры

//
&НаКлиенте
Процедура ЗагрузитьЧеки(Команда)
	
	ВыборПериода = Новый СписокЗначений;
	ВыборПериода.Добавить("ТекущаяНеделя", НСтр("ka='მიმდინარე კვირა';ru='Текущая неделя';en='This week'"));
	ВыборПериода.Добавить("ТекущийМесяц", НСтр("ka='მიმდინარე თვე';ru='Текущий месяц';en='Current month'"));
	ВыборПериода.Добавить("ПрошлыйМесяц", НСтр("ka='Прошлый и текущий месяц';ru='Прошлый и текущий месяц';en='Past and current month'"));
	ВыборПериода.Добавить("ТекущийКвартал", НСтр("ka='მიმდინარე კვარტალი';ru='Текущий квартал';en='current quarter'"));
	ВыборПериода.Добавить("ТекущийГод", НСтр("ka='მიმდინარე წელი';ru='Текущий год';en='This year'"));
	ВыборПериода.Добавить("Все", НСтр("ka='За все периоды';ru='За все периоды';en='For all periods'"));
	
	ПоказатьВыборИзМеню(Новый ОписаниеОповещения("ПослеВыбораПериода", ЭтотОбъект),ВыборПериода,Элементы.ЗагрузитьЧеки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПериода(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ПериодЗагрузки.ДатаОкончания = ТекущаяДата();
		
		Если Результат.Значение = "ТекущаяНеделя" Тогда
			ПериодЗагрузки.ДатаНачала = НачалоНедели(ТекущаяДата());
		ИначеЕсли Результат.Значение = "ТекущийМесяц" Тогда
			ПериодЗагрузки.ДатаНачала = НачалоМесяца(ТекущаяДата());
		ИначеЕсли Результат.Значение = "ПрошлыйМесяц" Тогда
			ПериодЗагрузки.ДатаНачала = НачалоМесяца(НачалоМесяца(ТекущаяДата())-1);
		ИначеЕсли Результат.Значение = "ТекущийКвартал" Тогда
			ПериодЗагрузки.ДатаНачала = НачалоКвартала(ТекущаяДата());
		ИначеЕсли Результат.Значение = "ТекущийГод" Тогда
			ПериодЗагрузки.ДатаНачала = НачалоГода(ТекущаяДата());
		ИначеЕсли Результат.Значение = "Все" Тогда
			ПериодЗагрузки.ДатаНачала = Дата(2016,1,1,1,1,1);
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаЗагрузкаЧеков", ЭтотОбъект);
		
		ЗаголовокВопроса = Нстр("ka='Загрузка чеков с кассового аппарата';ru='Загрузка чеков с кассового аппарата';en='Loading checks with cash register'");
		ТекстВопроса = Нстр("ka='Будут загружены все кассовые чеки за выбранный период. Загрузить?';ru='Будут загружены все кассовые чеки за выбранный период. Загрузить?';en='They will be loaded with all the cash receipts for the selected period. Download?'");
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Да, Нстр("ka='ჩატვირთვა';ru='Загрузить';en='Download'"));
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, Нстр("ka='გაუქმება';ru='Отменить';en='cancel'"));
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, СписокКнопок,, КодВозвратаДиалога.Да, ЗаголовокВопроса);
		
	КонецЕсли;
	
КонецПроцедуры
//
&НаКлиенте
Процедура ПослеВопросаВыгрузкаТоваров(Знач Результат, Знач ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыгрузитьТоварыНаСервере();
		ЗаголовокПредупреждения = НСтр("ka='Выгрузка товаров и цен';ru='Выгрузка товаров и цен';en='Unloading of goods and prices'");
		ТекстПредупреждения = НСтр("ru='Выгрузка товаров и цен займет около 3 минут."
" Вы можете продолжить работу с программой в это время.';ka='Выгрузка товаров и цен займет около 3 минут."
" Вы можете продолжить работу с программой в это время.'");
		ДополнительныеПараметры = Новый Структура("РежимТовары", Истина);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПредупрежденияОРегистрации", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьПредупреждение(ОписаниеОповещения, ТекстПредупреждения,, ЗаголовокПредупреждения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаСнятиеСРегистрации(Знач Результат, Знач ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаголовокПредупреждения = Нстр("ka='Отключение кассового аппарата.';ru='Отключение кассового аппарата.';en='Turn off the cash register.'");
		ДополнительныеПараметры = Новый Структура("Режим", 2);
		ТекстПредупреждения = НСтр("ka='Отключение может занять некоторое время.';ru='Отключение может занять некоторое время.';en='The trip can take some time.'");
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПредупрежденияОРегистрации", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьПредупреждение(ОписаниеОповещения, ТекстПредупреждения,, ЗаголовокПредупреждения);
	КонецЕсли;
КонецПроцедуры

//
&НаКлиенте
Процедура ПослеВопросаУдалениеТоваров(Знач Результат, Знач ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОчиститьТоварыНаСервере();
		ЗаголовокПредупреждения = НСтр("ka='საქონლის მოშორება';ru='Удаление товаров';en='removal of goods'");
		ТекстПредупреждения = НСтр("ru='Удаление товаров займет около 3 мин."
" Вы можете продолжить работу с программой в это время.';ka='Удаление товаров займет около 3 мин."
" Вы можете продолжить работу с программой в это время.'");
		ДополнительныеПараметры = Новый Структура("РежимТоварыОчистка", Истина);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПредупрежденияОРегистрации", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьПредупреждение(ОписаниеОповещения, ТекстПредупреждения,, ЗаголовокПредупреждения);
	КонецЕсли;
	
КонецПроцедуры
//
&НаКлиенте
Процедура ПослеВопросаЗагрузкаЧеков(Знач Результат, Знач ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗагрузитьЧекиНаСервере();
		ЗаголовокПредупреждения = НСтр("ka='Загрузка кассовых чеков';ru='Загрузка кассовых чеков';en='Loading cash checks'");
		ТекстПредупреждения = НСтр("ru='Загрузка кассовых чеков может занять продолжительное время."
" Вы можете продолжить работу с программой в это время.';ka='Загрузка кассовых чеков может занять продолжительное время."
" Вы можете продолжить работу с программой в это время.'");
		ДополнительныеПараметры = Новый Структура("РежимДокументы", Истина);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПредупрежденияОРегистрации", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьПредупреждение(ОписаниеОповещения, ТекстПредупреждения,, ЗаголовокПредупреждения);
	КонецЕсли;

КонецПроцедуры
//
&НаКлиенте
Процедура ПослеПредупрежденияОРегистрации(Знач ДополнительныеПараметры) Экспорт
	
	ЕстьОшибки = Ложь;
	СообщениеОбОшибке = "";
	
	Если НЕ ДополнительныеПараметры = Неопределено Тогда
		Если ДополнительныеПараметры.Свойство("Режим") Тогда
			ВыполнитьРегистрациюНаСервере(ДополнительныеПараметры.Режим, ЕстьОшибки, СообщениеОбОшибке);
			Если ЕстьОшибки Тогда
				ЗаголовокПредупреждения = Нстр("ka='Подключение кассового аппарата.';ru='Подключение кассового аппарата.';en='Connecting the cash register.'");
				ПоказатьПредупреждение(, СообщениеОбОшибке,, ЗаголовокПредупреждения);
			Иначе
				ОповеститьОбИзменении(Запись.КассаККМ);
				ПриЧтенииСозданииНаСервере();
			КонецЕсли;
		ИначеЕсли ДополнительныеПараметры.Свойство("РежимТовары") Тогда
			ВыполнитьВыгрузкуТоваровНаСервере(ЕстьОшибки, СообщениеОбОшибке);
			Если ЕстьОшибки Тогда
				ЗаголовокПредупреждения = Нстр("ka='Выгрузка товаров на кассовый аппарат.';ru='Выгрузка товаров на кассовый аппарат.';en='Unloading of goods at the cash register.'");
				ПоказатьПредупреждение(, СообщениеОбОшибке,, ЗаголовокПредупреждения);
			Иначе
				ОповеститьОбИзменении(Запись.КассаККМ);
				ПриЧтенииСозданииНаСервере();
			КонецЕсли;
		ИначеЕсли ДополнительныеПараметры.Свойство("РежимТоварыОчистка") Тогда
			ВыполнитьОчисткуТоваровНаСервере(ЕстьОшибки, СообщениеОбОшибке);
			Если ЕстьОшибки Тогда
				ЗаголовокПредупреждения = Нстр("ka='Очистка товаров на кассовом аппарате.';ru='Очистка товаров на кассовом аппарате.';en='Clearance of goods at the cash register.'");
				ПоказатьПредупреждение(, СообщениеОбОшибке,, ЗаголовокПредупреждения);
			Иначе
				ОповеститьОбИзменении(Запись.КассаККМ);
				ПриЧтенииСозданииНаСервере();
			КонецЕсли;
		ИначеЕсли ДополнительныеПараметры.Свойство("РежимДокументы") Тогда
			ВыполнитьЗагрузкуЧековНаСервере(ЕстьОшибки, СообщениеОбОшибке);
			Если ЕстьОшибки Тогда
				ЗаголовокПредупреждения = Нстр("ka='Загрузка чеков с кассового аппарата.';ru='Загрузка чеков с кассового аппарата.';en='Loading checks from the cash register.'");
				ПоказатьПредупреждение(, СообщениеОбОшибке,, ЗаголовокПредупреждения);
			Иначе
				ОповеститьОбИзменении(Запись.КассаККМ);
				ПриЧтенииСозданииНаСервере();
			КонецЕсли;
		КонецЕсли;
	Иначе
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПослеВопросаОЗаписиОбъекта(Знач Результат, Знач ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Успешно = Истина;
		Если Модифицированность Или НЕ ЗначениеЗаполнено(Запись.КассаККМ) Тогда
			Успешно = Записать();
		КонецЕсли;
		Если Успешно И ЗначениеЗаполнено(Запись.КассаККМ) Тогда
			ЗаголовокПредупреждения = Нстр("ka='Подключение кассового аппарата';ru='Подключение кассового аппарата';en='Connecting the cash register'");
			Если СостояниеРегистрации =
					ПредопределенноеЗначение("Перечисление.СостоянияРегистрацииКассовогоАппарата.Подключен") Тогда
				ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаСнятиеСРегистрации", ЭтотОбъект);
				
				ЗаголовокВопроса = Нстр("ka='Отключение кассового аппарата';ru='Отключение кассового аппарата';en='Turn off the cash register'");
				ТекстВопроса = Нстр("ka='После отключения данные по чекам не смогут быть загружены. Отключить?';ru='После отключения данные по чекам не смогут быть загружены. Отключить?';en='After tripping checks the data can not be downloaded. Disable?'");
				СписокКнопок = Новый СписокЗначений;
				СписокКнопок.Добавить(КодВозвратаДиалога.Да, Нстр("ka='გამორთვა';ru='Отключить';en='shut off'"));
				СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, Нстр("ka='გაუქმება';ru='Отменить';en='cancel'"));
				ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, СписокКнопок,, КодВозвратаДиалога.Да, ЗаголовокВопроса);
			Иначе
				Результат = ПодключитьОтключитьКассуПоТарифу(Истина);
				Если Результат Тогда
					ДополнительныеПараметры = Новый Структура("Режим", 1);
					ТекстПредупреждения = НСтр("ka='Подключение может занять некоторое время.';ru='Подключение может занять некоторое время.';en='Connection may take some time.'");
				Иначе
					ТекстПредупреждения = НСтр("ru='Закончились свободные лицензии для регистрации касс."
"Для регистрации кассового аппарата вам необходимо увеличить количество разрешенных касс по тарифу"
"в личном кабинете абонента.';ka='Закончились свободные лицензии для регистрации касс."
"Для регистрации кассового аппарата вам необходимо увеличить количество разрешенных касс по тарифу"
"в личном кабинете абонента.'");
				КонецЕсли;
				
				ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПредупрежденияОРегистрации", ЭтотОбъект, ДополнительныеПараметры);
				ПоказатьПредупреждение(ОписаниеОповещения, ТекстПредупреждения,, ЗаголовокПредупреждения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	МенеджерЗаписи = РегистрыСведений.НастройкиКассыШтрихМ.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.КассаККМ = Запись.КассаККМ;
	МенеджерЗаписи.Прочитать();
	
	Если НЕ МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.КассаККМ = Запись.КассаККМ;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(МенеджерЗаписи,"Запись");
	
	
	Токен = Формат(Запись.Токен, "ЧГ=");
	
	ИнформацияОКассе = Новый Структура("РегистрационныйНомер", Запись.РегистрационныйНомер);
	
	ЗарегистрированнаяКасса = ОбменСКассовымСерверомШтрихМ.ЗарегистрированнаяКассаНаСервере(ИнформацияОКассе, Ложь, "");
	
	УстановитьСостояниеОбъекта();
	
	ПериодЗагрузки.ДатаНачала = Запись.ДатаНачалаЗапросаЧеков;
	ПериодЗагрузки.ДатаОкончания = Запись.ДатаОкончанияЗапросаЧеков;
	
	ОрганизацияККМ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта( Запись.КассаККМ, "Владелец");
	// видимость прайслиста
	Если КоличествоПрайсЛистовОрганизации(ОрганизацияККМ) < 2 Тогда
		Элементы.ПрайсЛист.Видимость = Ложь;
		
		Если НЕ ЗначениеЗаполнено(Запись.ПрайсЛист) Тогда
			
			Запись.ПрайсЛист = ИнтеграцияОбменШтрихМ.ПолучитьПрайсЛистПоУмолчанию(ОрганизацияККМ);
			
		КонецЕсли;
		
	Иначе
		Элементы.ПрайсЛист.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗапись()
	
	Если НЕ Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	//Попытка
		НастройкиКассы = РеквизитФормыВЗначение("Запись");
		
		НастройкиКассы.Записать(Истина);
		
		ЗначениеВРеквизитФормы(НастройкиКассы, "Запись");
		
		Модифицированность = Ложь;
	//Исключение
	//	
	//КонецПопытки;
	
КонецПроцедуры

//
&НаСервере
Процедура ЗагрузитьЧекиНаСервере()
	
	МенеджерЗаписи = РеквизитФормыВЗначение("Запись");
	МенеджерЗаписи.ЗапроситьЧекиНаСервереШтрихМ = Истина;
	МенеджерЗаписи.ДатаНачалаЗапросаЧеков = ПериодЗагрузки.ДатаНачала;
	МенеджерЗаписи.ДатаОкончанияЗапросаЧеков = ПериодЗагрузки.ДатаОкончания;
	МенеджерЗаписи.Записать();
	ЗначениеВРеквизитФормы(МенеджерЗаписи, "Запись");
	
	УстановитьСостояниеОбменаЧеки();
	
КонецПроцедуры
//
&НаСервере
Процедура ВыгрузитьТоварыНаСервере()
	
	МенеджерЗаписи = РеквизитФормыВЗначение("Запись");
	МенеджерЗаписи.ЗарегистрироватьТоварыНаСервереШтрихМ = Истина;
	МенеджерЗаписи.Записать();
	ЗначениеВРеквизитФормы(МенеджерЗаписи, "Запись");
	
	УстановитьСостояниеОбменаТовары();
	
КонецПроцедуры
//
&НаСервере
Процедура ВыполнитьРегистрациюНаСервере(Режим, ЕстьОшибки, СообщениеОбОшибке)
	
	РеквизитыКассы = Новый Структура("РегистрационныйНомер, Токен, ИдентификаторОбластиНаСервереШтрихМ",
		Запись.РегистрационныйНомер,запись.Токен, Запись.ИдентификаторОбластиНаСервереШтрихМ);
		
	ОбменСКассовымСерверомШтрихМ.ВыполнитьРегистрациюНаСервере(РеквизитыКассы, Режим,
		ЕстьОшибки, СообщениеОбОшибке);
	
	
КонецПроцедуры
//
&НаСервере
Процедура ОчиститьТоварыНаСервере()
	
	МенеджерЗаписи = РеквизитФормыВЗначение("Запись");
	МенеджерЗаписи.ОчиститьТоварыНаСервереШтрихМ = Истина;
	МенеджерЗаписи.Записать();
	ЗначениеВРеквизитФормы(МенеджерЗаписи, "Запись");
	
	УстановитьСостояниеОбменаТовары();
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеОбменаТовары()
	
	СостояниеПодключен = СостояниеРегистрации = Перечисления.СостоянияРегистрацииКассовогоАппарата.Подключен;
	
	Ожидание = Ложь;
	Если Запись.ЗарегистрироватьТоварыНаСервереШтрихМ Тогда
		Элементы.ВыгрузитьТовары.Доступность = Ложь;
		Элементы.ВыгрузитьТовары.Заголовок = НСтр("ka='Идёт выгрузка товаров и цен';ru='Идёт выгрузка товаров и цен';en='There is unloading the goods and prices'");
		Элементы.ОчиститьТовары.Доступность = Ложь;
		Элементы.ОчиститьТовары.Заголовок = НСтр("ka='Удалить товары и цены';ru='Удалить товары и цены';en='Remove products and prices'");
		
		Ожидание = Истина;
		//Заголовок = СтрШаблон(НСтр("ka='%1 (%2)';ru='%1 (%2)';en='%12)'"),
		//	Запись.КассаККМ.Наименование, Элементы.ВыгрузитьТовары.Заголовок);
	ИначеЕсли Запись.ПроверитьРегистрациюТоваровНаСервереШтрихМ Тогда
		Элементы.ВыгрузитьТовары.Доступность = Ложь;
		Элементы.ВыгрузитьТовары.Заголовок = НСтр("ka='Проверка загрузки цен';ru='Проверка загрузки цен';en='Loading prices Check'");
		Элементы.ОчиститьТовары.Доступность = Ложь;
		Элементы.ОчиститьТовары.Заголовок = НСтр("ka='Удалить товары и цены';ru='Удалить товары и цены';en='Remove products and prices'");
		
		Ожидание = Истина;
		//Заголовок = СтрШаблон(НСтр("ka='%1 (%2)';ru='%1 (%2)';en='%12)'"),
		//	Запись.КассаККМ.Наименование, Элементы.ВыгрузитьТовары.Заголовок);
	ИначеЕсли Запись.ОчиститьТоварыНаСервереШтрихМ Тогда
		Элементы.ВыгрузитьТовары.Доступность = Ложь;
		Элементы.ВыгрузитьТовары.Заголовок = НСтр("ka='Выгрузить товары и цены';ru='Выгрузить товары и цены';en='Unload the goods and prices'");
		Элементы.ОчиститьТовары.Доступность = Ложь;
		Элементы.ОчиститьТовары.Заголовок = НСтр("ka='Идёт удаление товаров и цен';ru='Идёт удаление товаров и цен';en='There is a removal of the goods and prices'");
		
		Ожидание = Истина;
		//Заголовок = СтрШаблон(НСтр("ka='%1 (%2)';ru='%1 (%2)';en='%12)'"),
		//	Запись.КассаККМ.Наименование, Элементы.ОчиститьТовары.Заголовок);
	Иначе
		Элементы.ВыгрузитьТовары.Заголовок = НСтр("ka='Выгрузить товары и цены';ru='Выгрузить товары и цены';en='Unload the goods and prices'");
		Элементы.ОчиститьТовары.Заголовок = НСтр("ka='Удалить товары и цены';ru='Удалить товары и цены';en='Remove products and prices'");
		Элементы.ВыгрузитьТовары.Доступность = СостояниеПодключен;
		Элементы.ОчиститьТовары.Доступность = СостояниеПодключен;
	КонецЕсли;
	
	Элементы.Подключить.Доступность = Элементы.Подключить.Доступность И Не Ожидание;
КонецПроцедуры
//
&НаСервере
Процедура УстановитьСостояниеОбменаЧеки()
	
	СостояниеПодключен = СостояниеРегистрации = Перечисления.СостоянияРегистрацииКассовогоАппарата.Подключен;
	
	Ожидание = Ложь;
	Если Запись.ЗапроситьЧекиНаСервереШтрихМ Тогда
		Элементы.ЗагрузитьЧеки.Доступность = Ложь;
		Элементы.ЗагрузитьЧеки.Заголовок = НСтр("ka='Идёт загрузка чеков';ru='Идёт загрузка чеков';en='There is a check download'");
		Ожидание = Истина;
		//Заголовок = СтрШаблон(НСтр("ka='%1 (%2)';ru='%1 (%2)';en='%12)'"),
		//	Запись.КассаККМ.Наименование, Элементы.ЗагрузитьЧеки.Заголовок);
	Иначе
		Элементы.ЗагрузитьЧеки.Заголовок = НСтр("ka='ჩეკების ატვირთვა';ru='Загрузить чеки';en='Upload checks'");
	КонецЕсли;
	
	Элементы.Подключить.Доступность = Элементы.Подключить.Доступность И Не Ожидание;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьВыгрузкуТоваровНаСервере(ЕстьОшибки, СообщениеОбОшибке)
	
	ОбменСКассовымСерверомШтрихМПереопределяемый.ВыполнитьВыгрузкуТоваровНаСервере(Запись.КассаККМ,
		ЕстьОшибки, СообщениеОбОшибке);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОчисткуТоваровНаСервере(ЕстьОшибки, СообщениеОбОшибке)
	
	ИнформацияОКассе = Новый ТаблицаЗначений;
	ИнформацияОКассе.Колонки.Добавить("РегистрационныйНомер");
	ИнформацияОКассе.Колонки.Добавить("Результат");
	ИнформацияОКассе.Колонки.Добавить("СообщениеОбмена");
	СтрокаИнформации = ИнформацияОКассе.Добавить();
	СтрокаИнформации.РегистрационныйНомер = Запись.РегистрационныйНомер;
	ОбменСКассовымСерверомШтрихМ.ВыполнитьОчисткуТоваровНаКассовыхАппаратах(ИнформацияОКассе,
		ЕстьОшибки, СообщениеОбОшибке);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗагрузкуЧековНаСервере(ЕстьОшибки, СообщениеОбОшибке)
	
	ПараметрыМетода = Новый Структура();
	ИнформацияОКассе = Новый ТаблицаЗначений;
	ИнформацияОКассе.Колонки.Добавить("РегистрационныйНомер");
	ИнформацияОКассе.Колонки.Добавить("ДатаНачалаЗапросаЧеков");
	ИнформацияОКассе.Колонки.Добавить("ДатаОкончанияЗапросаЧеков");
	ИнформацияОКассе.Колонки.Добавить("Результат");
	ИнформацияОКассе.Колонки.Добавить("СообщениеОбмена");
	СтрокаИнформации = ИнформацияОКассе.Добавить();
	СтрокаИнформации.РегистрационныйНомер = Запись.РегистрационныйНомер;
	СтрокаИнформации.ДатаНачалаЗапросаЧеков = Запись.ДатаНачалаЗапросаЧеков;
	СтрокаИнформации.ДатаОкончанияЗапросаЧеков = Запись.ДатаОкончанияЗапросаЧеков;
	
	ПараметрыМетода.Вставить("ИнформацияОКассе", ИнформацияОКассе);
	ПараметрыМетода.Вставить("ЕстьОшибки", ЕстьОшибки);
	ПараметрыМетода.Вставить("СообщениеОбОшибке", СообщениеОбОшибке);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ka='Фоновое получение кассовых чеков';ru='Фоновое получение кассовых чеков';en='Background receive cash vouchers'");
	
	ДлительныеОперации.ВыполнитьВФоне(
		"ОбменСКассовымСерверомШтрихМПереопределяемый.ПолучитьКассовыеДокументыДляКассовыхАппаратов", ПараметрыМетода,
		ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Функция ПодключитьОтключитьКассуПоТарифу(Подключить)
	
	// Тариф проверям только во Фреше.
	Если НЕ ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Подключить Тогда
		Результат = ТарификацияПереопределяемый.ПодключениеКассыПоТарифу(Запись.РегистрационныйНомер);
		Если Результат Тогда
			ТекстСообщения = СтрШаблон(НСтр("ka='Занята лицензия %1 на сервере лицензий';ru='Занята лицензия %1 на сервере лицензий';en='1% is occupied by the license on the license server'"), Запись.РегистрационныйНомер);
			ОбменСКассовымСерверомШтрихМ.ЗаписатьВПротоколКассовогоАппарата(Запись.РегистрационныйНомер, ТекстСообщения);
			Запись.ИдентификаторТарификации = Запись.РегистрационныйНомер;
			Модифицированность = Истина;
			ЗаписатьЗапись();
		КонецЕсли;
		
	Иначе
		Результат = ТарификацияПереопределяемый.ОтменаРегистрацииКассыНаСервереТарификации(Запись.ИдентификаторТарификации);
		Если Результат Тогда
			ТекстСообщения = СтрШаблон(НСтр("ka='Освобождена лицензия %1 на сервере лицензий';ru='Освобождена лицензия %1 на сервере лицензий';en='Freed license% 1 on the license server'"), Запись.ИдентификаторТарификации);
			ОбменСКассовымСерверомШтрихМ.ЗаписатьВПротоколКассовогоАппарата(Запись.РегистрационныйНомер, ТекстСообщения);
			Запись.ИдентификаторТарификации = "";
			Модифицированность = Истина;
			ЗаписатьЗапись();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура УстановитьСостояниеОбъекта()
	
	СостояниеРегистрации = ОбменСКассовымСерверомШтрихМПереопределяемый.СостояниеРегистрацииККМ(Запись.КассаККМ);
	
	Элементы.РегистрационныйНомер.ТолькоПросмотр = Истина;
	Элементы.Токен.ТолькоПросмотр = Истина;
	Подключен = Ложь;
	
	Если СостояниеРегистрации = Перечисления.СостоянияРегистрацииКассовогоАппарата.НеПодключен Тогда
		Элементы.Подключить.Заголовок = Нстр("ka='მივუერთოთ';ru='Подключить';en='To plug'");
		Элементы.Подключить.Доступность = Истина;
		Элементы.РегистрационныйНомер.ТолькоПросмотр = Ложь;
		Элементы.Токен.ТолькоПросмотр = Ложь;
	ИначеЕсли СостояниеРегистрации = Перечисления.СостоянияРегистрацииКассовогоАппарата.Подключен Тогда
		Элементы.Подключить.Заголовок = Нстр("ka='გამორთვა';ru='Отключить';en='shut off'");
		Элементы.Подключить.Доступность = Истина;
		Элементы.Токен.ТолькоПросмотр = Ложь;
		Подключен = ЗначениеЗаполнено(Запись.КассаККМ);
	ИначеЕсли СостояниеРегистрации = Перечисления.СостоянияРегистрацииКассовогоАппарата.ОжидаетПодключение Тогда
		Элементы.Подключить.Заголовок = Нстр("ka='მიმდინარეობს შეერთება';ru='Идёт подключение';en='There is a connection'");
		Элементы.Подключить.Доступность = Ложь;
	ИначеЕсли СостояниеРегистрации = Перечисления.СостоянияРегистрацииКассовогоАппарата.ОжидаетПереподключение Тогда
		Элементы.Подключить.Заголовок = Нстр("ka='მიმდინარეობს ხელახლა შეერთება';ru='Идёт переподключение';en='There is a reconnection'");
		Элементы.Подключить.Доступность = Ложь;
	ИначеЕсли СостояниеРегистрации = Перечисления.СостоянияРегистрацииКассовогоАппарата.ОжидаетОтключение Тогда
		Элементы.Подключить.Заголовок = Нстр("ka='მიდის გამორთვა';ru='Идёт отключение';en='There is a disconnect'");
		Элементы.Подключить.Доступность = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.КассаККМ) Тогда
		Элементы.Подключить.Доступность = Ложь;
	КонецЕсли;
	
	Элементы.ЗагрузитьЧеки.Доступность = Подключен;
	
	Заголовок = СтрШаблон(
		НСтр("ka='%1 (%2)';ru='%1 (%2)';en='%12)'"),
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта( Запись.КассаККМ,"Наименование"),
		СостояниеРегистрации);
	
	Если Подключен Тогда
		УстановитьСостояниеОбменаТовары();
		УстановитьСостояниеОбменаЧеки();
	КонецЕсли;
	
	Если СостояниеРегистрации = Перечисления.СостоянияРегистрацииКассовогоАппарата.НеПодключен И ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		ИнформацияПоТарифу = Тарификация.КоличествоЛицензийУникальнойУслуги("1С_Касса", "КоличествоКасс");
		Если ИнформацияПоТарифу.СвободноЛицензий = 0 Тогда
			Элементы.СтраницыПодключения.ТекущаяСтраница = Элементы.СтраницаНетЛицензий;
			Элементы.ДекорацияНетЛицензий.Заголовок = 
				НСтр("ka='Нет возможности подключения к сервису. Обратитесь к обслуживающему вас партнеру комании 1С.';ru='Нет возможности подключения к сервису. Обратитесь к обслуживающему вас партнеру комании 1С.';en='No connectivity to the service. See your partner Addiction 1C.'");
		Иначе
			Элементы.СтраницыПодключения.ТекущаяСтраница = Элементы.СтраницаПодключения;
		КонецЕсли;
	Иначе
		Элементы.СтраницыПодключения.ТекущаяСтраница = Элементы.СтраницаПодключения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗарегистрированнаяКасса) Тогда
		ПротоколОбмена = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗарегистрированнаяКасса, "СообщениеПриРегистрации");
	Иначе
		ПротоколОбмена = Запись.СообщениеПриРегистрации;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция КоличествоПрайсЛистовОрганизации(Организация) 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПрайсЛисты.Ссылка) КАК КоличествоПрайсов
	|ИЗ
	|	Справочник.ПрайсЛисты КАК ПрайсЛисты
	|ГДЕ
	|	НЕ ПрайсЛисты.ПометкаУдаления
	|	И ПрайсЛисты.Организация = &Организация");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоПрайсов;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
